; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	image3 - mode
	thermograph11 - mode
	infrared0 - mode
	infrared6 - mode
	image4 - mode
	spectrograph5 - mode
	infrared2 - mode
	infrared12 - mode
	thermograph1 - mode
	image8 - mode
	spectrograph9 - mode
	infrared10 - mode
	image7 - mode
	GroundStation0 - direction
	GroundStation1 - direction
	Star2 - direction
	GroundStation4 - direction
	GroundStation3 - direction
	Phenomenon5 - direction
	Star6 - direction
	Planet7 - direction
	Star8 - direction
	Phenomenon9 - direction
)
(:init
	(supports instrument0 spectrograph5)
	(supports instrument0 infrared6)
	(supports instrument0 image7)
	(supports instrument0 infrared10)
	(supports instrument0 spectrograph9)
	(supports instrument0 image8)
	(supports instrument0 thermograph1)
	(supports instrument0 infrared12)
	(supports instrument0 infrared2)
	(supports instrument0 image4)
	(supports instrument0 infrared0)
	(supports instrument0 thermograph11)
	(supports instrument0 image3)
	(calibration_target instrument0 GroundStation3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet7)
)
(:goal (and
	(pointing satellite0 GroundStation1)
	(have_image Phenomenon5 infrared0)
	(have_image Phenomenon5 image4)
	(have_image Phenomenon5 infrared12)
	(have_image Star6 spectrograph9)
	(have_image Star6 infrared2)
	(have_image Planet7 image3)
	(have_image Planet7 spectrograph9)
	(have_image Star8 thermograph1)
	(have_image Phenomenon9 spectrograph5)
	(have_image Phenomenon9 infrared12)
))

)

; plan
1. (turn_to satellite0 groundstation3 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 groundstation3)
   goals met: 0 of 11
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 11
3. (calibrate satellite0 instrument0 groundstation3)
   added: (calibrated instrument0)
   goals met: 0 of 11
4. (turn_to satellite0 star8 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 star8)
   goals met: 0 of 11
5. (take_image satellite0 star8 instrument0 thermograph1)
   added: (have_image star8 thermograph1)
   goals met: 1 of 11
6. (turn_to satellite0 phenomenon9 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 phenomenon9)
   goals met: 1 of 11
7. (take_image satellite0 phenomenon9 instrument0 spectrograph5)
   added: (have_image phenomenon9 spectrograph5)
   goals met: 2 of 11
8. (take_image satellite0 phenomenon9 instrument0 infrared12)
   added: (have_image phenomenon9 infrared12)
   goals met: 3 of 11
9. (turn_to satellite0 phenomenon5 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 phenomenon5)
   goals met: 3 of 11
10. (take_image satellite0 phenomenon5 instrument0 infrared12)
   added: (have_image phenomenon5 infrared12)
   goals met: 4 of 11
11. (take_image satellite0 phenomenon5 instrument0 infrared0)
   added: (have_image phenomenon5 infrared0)
   goals met: 5 of 11
12. (take_image satellite0 phenomenon5 instrument0 image4)
   added: (have_image phenomenon5 image4)
   goals met: 6 of 11
13. (turn_to satellite0 planet7 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 planet7)
   goals met: 6 of 11
14. (take_image satellite0 planet7 instrument0 image3)
   added: (have_image planet7 image3)
   goals met: 7 of 11
15. (take_image satellite0 planet7 instrument0 spectrograph9)
   added: (have_image planet7 spectrograph9)
   goals met: 8 of 11
16. (turn_to satellite0 star6 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 star6)
   goals met: 8 of 11
17. (take_image satellite0 star6 instrument0 infrared2)
   added: (have_image star6 infrared2)
   goals met: 9 of 11
18. (take_image satellite0 star6 instrument0 spectrograph9)
   added: (have_image star6 spectrograph9)
   goals met: 10 of 11
19. (turn_to satellite0 groundstation1 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 groundstation1)
   goals met: 11 of 11
